<?php
namespace Zoghal\PersianTools\Tools;

class Virastar
{

    public $LikePersianChars = [
        "ا" => ['ا', 'ݳ', 'ݴ'],
        'ب' => ['ٻ', 'ڀ', 'ݑ', 'ݔ', 'ݕ', 'ݖ'],
        'پ' => ['پ', 'ݐ', 'ݒ', 'ݓ'],
        'ت' => ['ت', 'ٺ', 'ټ', 'ٽ', 'ٿ'],
        'ث' => ['ث', 'ٹ'],
        'ج' => ['ج', 'ڃ', 'ڄ', 'ݼ'],
        'چ' => ['چ', 'ڇ', 'ڿ', 'ݘ', 'ݮ', 'ݯ'],
        'ح' => ['ح', 'ځ', 'ڂ', 'څ', 'ݗ'],
        'خ' => ['خ', 'ݲ'],
        'د' => ['د', 'ڈ', 'ډ', 'ڊ', 'ڋ', 'ڌ', 'ڍ', 'ڎ', 'ڏ', 'ڐ', 'ݙ', 'ݚ', 'ۮ'],
        'ذ' => ['ذ'],
        'ر' => ['ر', 'ړ', 'ڔ', 'ڕ', 'ږ', 'ݛ', 'ހ', 'ۯ', 'ڑ', 'ڒ', 'ݬ', 'ݫ', 'ڗ', 'ڙ', 'ݱ'],
        'ز' => ['ز'],
        'ژ' => ['ژ'],
        'س' => ['س', 'ښ', 'ڛ', 'ݭ', 'ݽ'],
        'ش' => ['ش', 'ݜ', 'ڜ', 'ݰ', 'ݾ', 'ۺ'],
        'ص' => ['ص', 'ڝ', 'ڞ'],
        'ض' => ['ض', 'ۻ'],
        'ط' => ['ط', 'ڟ'],
        'ظ' => ['ظ'],
        'ع' => ['ع'],
        'غ' => ['غ', 'ڠ', 'ݝ', 'ݞ', 'ݟ', 'ۼ'],
        'ف' => ['ف', 'ڡ', 'ڢ', 'ڣ', 'ڤ', 'ڥ', 'ڦ', 'ݠ', 'ݡ'],
        'ق' => ['ق', 'ٯ', 'ڧ', 'ڨ'],
        'ک' => ['ک', 'ػ', 'ؼ', 'ك', 'ڪ', 'ګ', 'ڬ', 'ڭ', 'ڮ', 'ݢ', 'ݣ', 'ݤ', 'ݿ'],
        'گ' => ['گ', 'ڰ', 'ڱ', 'ڲ', 'ڳ', 'ڴ'],
        'ل' => ['ل', 'ڵ', 'ڶ', 'ڷ', 'ڸ', 'ݪ'],
        'م' => ['م', 'ݥ', 'ݦ', '۾'],
        'ن' => ['ن', 'ڹ', 'ں', 'ڻ', 'ڼ', 'ڽ', 'ݧ', 'ݨ', 'ݩ'],
        'و' => ['و', 'ٶ', 'ٷ', 'ۄ', 'ۅ', 'ۆ', 'ۇ', 'ۈ', 'ۉ', 'ۊ', 'ۋ', 'ۏ', 'ݸ', 'ݹ'],
        'هٔ' => ['ۂ'],
        'ه' => ['ه', 'ھ', 'ہ', 'ۂ', 'ۃ', 'ە', 'ۿ'],
        'ی' => ['ی', 'ؽ', 'ؾ', 'ؿ', 'ي', 'ٸ', 'ۍ', 'ێ', 'ې', 'ۑ', 'ے', 'ۓ', 'ݵ', 'ݶ', 'ݷ', 'ݺ', 'ݻ'],
    ];

    public static function cleanNonPersianCharacters($text)
    {

    }
}
